let knowledge = 
[
    ["", "", ""],
    ["магнитные свойства", "обусловлены", "движением электрических зарядов."],
    
    ["магнитный момент электронной оболочки", "определяет", "магнитные свойства атома."],
    //оценивает??
    ["магнитная восприимчивость",  "оценивает", "силу взаимодействия вещества с магнитным полем."],
    ["магнитная восприимчивость", "- это", "отношение намагниченности к напряженности магнитного"],
    ["все вещества по силе взаимодействия", "разделяются", "на сильномагнитные и слабомагнитные."],
    ["ферромагнетики", "- это", "вещества, которые могут обладать спонтанной намагниченностью, т. е. намагничены уже при отсутствии внешнего магнитного поля."],
    
    // ["намагниченность ферромагнетиков", "превосходит", "в огромное (до 10 10 ) число раз намагниченность диа- и парамагнетиков"],
    // ["химические элементы", "обладают ферромагнитными свойствами", "Fe, Co, Ni, Gd, Dy, Tb, Ho, Er, Tm"],
    
    ["сплавы Гейслера", "- это", " ферромагнитные металлические сплавы, компоненты которых сами по себе не являются ферромагнитными."],
    ["аморфные ферромагнитные сплавы", "можно получить", "путем быстрой закалки жидкого сплава."],
    ["преимущество аморфных сплавов", "состоит", "в том что их свойсва почти изотропны."],
    ["постоянные магниты", "- это", "тела, способные сохранять намагниченность на протяжении длительного времени."],
    ["диамагнетики", "относятся", "к слабомагнитным веществам."],
    ["парамагнетики", "относятся", "к слабомагнитным веществам."],
    ["антиферромагнетики", "относятся", "к слабомагнитным веществам."],
    ["ферромагнетики", "относятся", "к сильномагнитным веществам."],
    ["ферримагнетики", "относятся", "к сильномагнитным веществам."],
    ["диамагнетики", "- это", "вещества, намагничивающиеся против направления внешнего магнитного поля. "],
    ["парамагнетики", "- это", "ещества, которые намагничиваются во внешнем магнитном поле в направлении внешнего магнитного поля (J↑↑H) и имеют положительную магнитную восприимчивость, но значительно меньшую единицы."],
    ["характерной особенностью ферромагнетиков", "явялется", "сложная нелинейная зависимость намагниченности J от напряженности H магнитного поля"],
    
    //img

    //??
    ["Александр Григорьевич Столетов", "открыл", "явление магнитного насыщения в 1872 г."],
    ["магнитная индукция в веществе", "равна", "B = μ<sub>0</sub>H + μ<sub>0</sub>J"],
    ["максимальная магнитная проницаемость чистого железа", "равна", "5000"],
    ["максимальная магнитная проницаемость чистого молибденового пермаллоя", "равна", "150 000"],
    ["магнитный гистерезис", "- это", "неоднозначная зависимость вектора магнитной индукции от напряженности внешенего магнитного поля, которая определяется предысторией намагничивания образца ферромагнетика."],
    ["остаточная намагниченность", "- это", "намагниченность M, которой обладает ферромагнитный материал при нулевой напряжённости внешнего магнитного поля H."],
    ["коэрцитивная сила", "- это", "это значение напряжённости внешнего магнитного поля, необходимое для полного размагничивания ферро- или ферримагнитного вещества."],
    ["петля гистрезиса", "- это", "кривая изменения индукции магнитного поля В в ферромагнетике в зависимости от изменения напряженности внешнего магнитного поля Н."],
    ["постоянные магниты", "- это", "тела, которые без затраты энергии создают в окружающем их пространстве магнитное поле."],
    ["постоянный магнит", "сохряняет", "свои свойства лучше, чем больше коэрцитивная сила материала, из которого он изготовлен."],
    ["ферромагнетики", "делятся", "на жесткие и мягкие."],
    ["ферромагнетики с малой коэрцитивной силой", "называются", "мягкими"],
    ["ферромагнетики с большой коэрцитивной силой", "называются", "жесткими"],
    ["жесткие ферромагнетики", "используют", "для изготовления постоянных магнитов."],
    ["мягкие ферромагнетики", "используют", "для изготовления сердечников трансформаторов"],
    ["магнитомягкие материалы", "можно разделить", "на следующие груп­пы: технически чистое железо (низкоуглеродистая сталь); кремни­стая электротехническая сталь; сплавы с высокой начальной маг­нитной проницаемостью (пермаллои); сплавы с большой индукцией насыщения (пермендюр); ферриты."],
    ["опытами Эйнштейна - де Газа и Барнетта", "было доказано", ", что ферромагнетизм связан с упорядочением спиновых магнитных моментов атомов."],
    ["спины электронов", "стремятся", "ориентироваться в одном направлении при отсутствии внешних магнитных полей."],
    ["спиновые магнитные моменты", "ориентируются", "в противоположном спинам электронов направлении."],
    ["образец", "разбивается", "на домены."],
    ["домены", "- это", "малые макроскопические области спонтанного, т. е. самопроизвольного, намагничивания."],
    ["домены", "содержат", "большое число атомов."],
    ["спиновые магнитные моменты электронов в пределах одного домена", "ориентированы", "одинаково"],
    ["возникновение доменной структуры", "соответсвует", "минимуму энергии тела"],
    ["", "", ""]
];

let endings =
[
    ["ет","(ет|ут|ют)"], 
    ["ут","(ет|ут|ют)"], 
    ["ют","(ет|ут|ют)"],		     //1 спряжение

    ["ит","(ит|ат|ят)"], 
    ["ат","(ит|ат|ят)"], 
    ["ят","(ит|ат|ят)"],		     //2 спряжение

    ["ется","(ет|ут|ют)ся"], 
    ["утся","(ет|ут|ют|ующие)ся"], 
    ["ются","(ет|ут|ют)ся"], //1 спряжение, возвратные

    ["ится","(ит|ат|ят)ся"], 
    ["атся","(ит|ат|ят)ся"], 
    ["ятся","(ит|ат|ят)ся"],     //2 спряжение, возвратные

    ["ящие","ящие"],
    ["ee", "ee"],
    ["ен","ен"],
    ["ую","ая"],
    ["му","ма"],
    ["ена","ена"], 
    ["ено","ено"], 
    ["ены","ены"],		    //краткие прилагательные

    ["ан","ан"], 
    ["ая","ую"],
    ["ана","ана"], 
    ["ано","ано"], 
    ["аны","аны"],		    //краткие прилагательные

    ["жен","жен"], 
    ["жна","жна"], 
    ["жно","жно"], 
    ["жны","жны"],

    ["такое"," - это"] ,
]

let blacklist = ["замена", "замены", "атрибут", "маршрут", "член", "нет"]

function getEndingIndex(word)
{
    //проверка слова на совпадение по черному списку в массиве blacklist
    if(blacklist.indexOf(word) !== -1)
        return -1;
    
    for(let i = 0; i < endings.length; i++)
        if(word.substring(word.length - endings[i][0].length) == endings[i][0])
            return i;

    return -1;
}

function firstSymbolToLowerCase(str)
{
    return str.substring(0, 1).toLowerCase() + str.substring(1);
}

function firstSymbolToUpperCase(str)
{
    return str.substring(0, 1).toUpperCase() + str.substring(1);
}

function getAnswer(question)
{
    //преобразование текста из параметра функции question 
    //чтобы сделать первую букву в тексте вопроса прописной
    let text = firstSymbolToLowerCase(question);
    //знаки препинания
    let separators = "'\",.!?()[]\\/";
    //добавление пробелов перед знаками препинания
    for(let i = 0; i < separators.length; i++)
        text = text.replace(separators[i], " " + separators[i]);

    //массив слов и знаков препинания, отделенных пробелами
    let words = text.split(' ');

    //перебор слов в массиве слов из вопроса
    for(let i = 0; i < words.length; i++)
        words[i] = firstSymbolToLowerCase(words[i]);

    let result = false;
    let answer = "";

    for(let i = 0; i < words.length; i++)
    {
        let ending = getEndingIndex(words[i]);

        if(ending >= 0)
        {
            words[i] = words[i].substring(0, words[i].length - endings[ending][0].length) + endings[ending][1]

            console.log(words)
            
            //создание регулярного выражения для поиска по сказуемому из вопроса
            let predicate = new RegExp(".*" + words[i] + ".*");

            //для кратких прилагательных нужно захватить следующее за найденным слово
            if(endings[ending][0] == endings[ending][1])
            {
                if(words[i] != "нужен")
                {
                    predicate = new RegExp(".*" + words[i] + " " + words[i + 1] + ".*");
                    i++;
                }
            }
            console.log(predicate)  

            //создание регулярного выражения для поиска по подлежащему из вопроса
            let subjectReg = words.slice(i + 1).join(".*");
            console.log(subjectReg)
            
            //только если в подлежащем больше трех символов
            if(subjectReg.length > 3)
            {
                let subject = new RegExp(".*" + subjectReg + ".*");
                console.log(subject)

                //поиск совпадений с шаблонами среди связей семантической сети
                for(let j = 0; j < knowledge.length; j++)
                {
                    if(predicate.test(knowledge[j][1].toLowerCase()) && (subject.test(knowledge[j][0].toLowerCase()) || subject.test(knowledge[j][2].toLowerCase())))
                    {
                        //создание простого предложения из семантической связи
                        answer += firstSymbolToUpperCase(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2] + "<br>");
                        result = true;
                    }
                }

                //если совпадений с двумя шаблонами нет,
                if(!result)
                {
                    //поиск совпадений только с шаблоном подлежащего
                    for(let j = 0; j < knowledge.length; j++)
                    {
                        if(subject.test(knowledge[j][0].toLowerCase() || subject.test(knowledge[j][2].toLowerCase())))
                        {
                            //создание простого предложения из семантической связи
                            answer += firstSymbolToUpperCase(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2] + "<br>");
                            result = true;
                            break;
                        }
                    }
                }
            }
        }
    }
    //если ответа нет
    if(!result)
        answer = "Ответ не найден. <br/>";

    return answer;
}

console.log(getAnswer("для чего используются мягкие ферромагнетики"));